import { Component } from '@angular/core';

@Component({
  selector: 'app-hobby',
  templateUrl: './hobby.component.html',
  styleUrls: ['./hobby.component.css']
})
export class HobbyComponent {
  nameText_1:string = 'Мої міркування про хобі';
  nameText_2:string = 'Моє улюблене хобі — спорт';
  text_1_1:string = 'Напевно, на світі немає людини, у якої не було б хобі, тобто улюбленого заняття. І неважливо, з чим це пов’язано — зі співом, малюванням, письменством, кулінарією або фотографією. Це не робота, не обов’язок і навіть не додатковий спосіб заробітку. Це почуття, бажання отримати задоволення від процесу та добитися ідеального результату, завзятість у придбанні й розвитку навичок. Або просто відпочинок після важкого робочого дня.';
  text_1_2:string = 'Хобі — це найкраще проведення часу. Це коли певна справа по-справжньому тобі подобається, коли ти нею живеш і готовий безперестанку розповідати про свої та чужі досягнення в цій сфері. Це означає, що коли-небудь і ти станеш майстром своєї справи та, можливо, пов’яжеш її зі своєю майбутньою професією. Якщо захочеш…';
  text_2_1:string = 'Я шалено люблю обидва своїх хобі. Але є у мене й третє — найулюбленіше, найкраще, просто хобі номер один. Я обожнюю спорт. Займаюся фітнесом і просто не можу уявити своє життя без будь-яких фізичних навантажень. Я зовсім не розумію людей, які постійно сидять вдома. Адже не дарма кажуть, що рух — це життя.';
  text_2_2:string = 'Мені здається, що спорт — ідеальне заняття в будь-якому його прояві. Гімнастика, акробатика, підняття важких предметів, їзда верхи, катання на ковзанах — все це просто чудово. Мені цікавий будь-який вид спорту, навіть якщо я їм не займаюся. Мені подобається розмовляти з фахівцями з різних спортивних галузей, чи то плавець, чи то футболіст. Я дізнаюся від них багато цікавого. Пропоную їм розповісти про свої досягнення, а також сама ділюся власними враженнями.';
}
